sdaiPutADBTypePath(Sdai_ADBId*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**)
\details
Specifies the type path for an attribute data block (ADB).
The type path consists of an array of strings that defines the path in the nested SELECT types hierarchy.
\param block          [in] An attribute data block (ADB) instance.
\param typeNameNumber [in] A size of the string array that defines the path.
\param typeNameVector [in] A string array with the path.